## 데이터 입출력
- csv, excel, html, json, hdf5, sas, stata, sql....
- csv : 쉽표로 구분되어 있는 텍스트 파일

In [4]:
import numpy as np
import pandas as pd

In [8]:
%%writefile sample.csv
no, score, name
1, 1.11, one
2, 2.22, two
3, 3.33, three

Writing sample.csv

In [9]:
%ls

 C 드라이브의 볼륨에는 이름이 없습니다.
 볼륨 일련 번호: 50EE-7FC3

 C:\K_digital\source\python base 디렉터리

2022-10-26  오전 09:11    <DIR>          .
2022-10-26  오전 09:11    <DIR>          ..
2022-10-26  오전 09:05    <DIR>          .ipynb_checkpoints
2022-10-26  오전 09:11             5,871 04 pandas 데이터분석.ipynb
2022-10-25  오후 05:41    <DIR>          Data Science with Python
2022-09-22  오전 11:53    <DIR>          day001
2022-09-30  오후 05:41            77,413 RR.ipynb
2022-10-26  오전 09:11                61 sample.csv
2022-09-27  오후 03:38             3,202 Untitled.ipynb
2022-09-22  오후 07:23            26,052 보원언니 커피.ipynb
2022-09-22  오후 07:15            12,708 영현오빠 커피.ipynb
2022-09-22  오후 07:27            16,114 커피 진행중.ipynb
               7개 파일             141,421 바이트
               5개 디렉터리  186,966,290,432 바이트 남음

In [10]:
# csv 파일 읽기
pd.read_csv('sample.csv')

   no   score    name
0   1    1.11     one
1   2    2.22     two
2   3    3.33   three

In [11]:
%%writefile sample1.csv
1, 1.11, one
2, 2.22, two
3, 3.33, three

Writing sample1.csv

In [15]:
pd.read_csv('sample1.csv', header = None)

   0     1       2
0  1  1.11     one
1  2  2.22     two
2  3  3.33   three

In [16]:
pd.read_csv('sample1.csv', names=['c1','c2','c3'])

   c1    c2      c3
0   1  1.11     one
1   2  2.22     two
2   3  3.33   three

In [17]:
pd.read_csv('sample.csv', index_col = 'no')

     score    name
no
1     1.11     one
2     2.22     two
3     3.33   three

In [18]:
%%writefile sample2.txt
c1       c2        c3       c4
0.179187 -1.538472 1.347553 0.43381
1.179187 -2.538472 1.357553 0.33381
2.179187 -3.538472 1.367553 0.23381
3.179187 -4.538472 1.377553 0.13381
4.179187 -5.538472 1.387553 0.03381

Writing sample2.txt

In [19]:
pd.read_csv('sample2.txt', sep='\s+')

         c1        c2        c3       c4
0  0.179187 -1.538472  1.347553  0.43381
1  1.179187 -2.538472  1.357553  0.33381
2  2.179187 -3.538472  1.367553  0.23381
3  3.179187 -4.538472  1.377553  0.13381
4  4.179187 -5.538472  1.387553  0.03381

In [20]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
df = pd.DataFrame(data)
df

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [21]:
df.to_csv('sample3.csv', index = True, header = True)

In [22]:
!type sample3.csv

,state,year,pop
0,Ohio,2000,1.5
1,Ohio,2001,1.7
2,Ohio,2002,3.6
3,Nevada,2001,2.4
4,Nevada,2002,2.9
5,Nevada,2003,3.2

In [23]:
%ls

 C 드라이브의 볼륨에는 이름이 없습니다.
 볼륨 일련 번호: 50EE-7FC3

 C:\K_digital\source\python base 디렉터리

2022-10-26  오전 09:27    <DIR>          .
2022-10-26  오전 09:27    <DIR>          ..
2022-10-26  오전 09:05    <DIR>          .ipynb_checkpoints
2022-10-26  오전 09:27            19,551 04 pandas 데이터분석.ipynb
2022-10-25  오후 05:41    <DIR>          Data Science with Python
2022-09-22  오전 11:53    <DIR>          day001
2022-09-30  오후 05:41            77,413 RR.ipynb
2022-10-26  오전 09:11                61 sample.csv
2022-10-26  오전 09:14                44 sample1.csv
2022-10-26  오전 09:22               217 sample2.txt
2022-10-26  오전 09:26               125 sample3.csv
2022-09-27  오후 03:38             3,202 Untitled.ipynb
2022-09-22  오후 07:23            26,052 보원언니 커피.ipynb
2022-09-22  오후 07:15            12,708 영현오빠 커피.ipynb
2022-09-22  오후 07:27            16,114 커피 진행중.ipynb
              10개 파일             155,487 바이트
               5개 디렉터리  186,950,160,384 바이트 남음

## 데이터프레임 고급 인덱싱

In [24]:
# loc : 라벨값 기준으로 인덱싱, df.loc[행 인덱싱값] or df.loc[행 인덱싱값, 열 인덱싱값]
# iloc : 정수 기반의 인덱싱

In [25]:
df = pd.DataFrame(np.arange(10, 22).reshape(3, 4),
                 index = ['a', 'b', 'c'],
                 columns = ['one', 'two', 'three', 'four'])

In [26]:
df

   one  two  three  four
a   10   11     12    13
b   14   15     16    17
c   18   19     20    21

In [27]:
# 인덱싱값 하나만 받아오는 경우
df.loc['b']

one      14
two      15
three    16
four     17
Name: b, dtype: int32

In [28]:
df.loc['b':'c']

   one  two  three  four
b   14   15     16    17
c   18   19     20    21

In [30]:
df['b':'c'] # 콜론[:]을 쓸 경우 loc를 쓰지 않아도 됨

   one  two  three  four
b   14   15     16    17
c   18   19     20    21

In [31]:
df.loc[['b','c']] # 이 때는 loc를 불러와야 함

   one  two  three  four
b   14   15     16    17
c   18   19     20    21

In [32]:
df[['b', 'c']]

KeyError: "None of [Index(['b', 'c'], dtype='object')] are in the [columns]"

In [33]:
df['one']

a    10
b    14
c    18
Name: one, dtype: int32

In [34]:
df.one

a    10
b    14
c    18
Name: one, dtype: int32

In [35]:
df.one > 15

a    False
b    False
c     True
Name: one, dtype: bool

In [37]:
df[df.one > 15]

   one  two  three  four
c   18   19     20    21

In [38]:
df.loc[df.one > 15]

   one  two  three  four
c   18   19     20    21

In [39]:
def select_row(df):
    return df.one > 15

In [40]:
select_row(df)

a    False
b    False
c     True
Name: one, dtype: bool

In [41]:
df[select_row(df)]

   one  two  three  four
c   18   19     20    21

In [42]:
df2 = pd.DataFrame(np.arange(10, 26).reshape(4, 4),
                  columns = list('ABCD'))
df2

    A   B   C   D
0  10  11  12  13
1  14  15  16  17
2  18  19  20  21
3  22  23  24  25

In [43]:
df2.loc[1:2]

    A   B   C   D
1  14  15  16  17
2  18  19  20  21

#### 인덱싱값을 이용해서 행과 열 모두 추출하는 경우
- df.loc[행인덱스, 열인덱스]

In [44]:
df2.loc[0,'A']

10

In [45]:
df

   one  two  three  four
a   10   11     12    13
b   14   15     16    17
c   18   19     20    21

In [46]:
df.loc['b', 'two']

15

In [47]:
df.loc['b': ,'one']

b    14
c    18
Name: one, dtype: int32

In [48]:
df.loc['a', :]

one      10
two      11
three    12
four     13
Name: a, dtype: int32

In [49]:
df.loc[['a', 'b'], ['two', 'four']]

   two  four
a   11    13
b   15    17

In [50]:
df.loc[df.one > 10]

   one  two  three  four
b   14   15     16    17
c   18   19     20    21

In [51]:
df.loc[df.one >10, ['three', 'four']]

   three  four
b     16    17
c     20    21

In [52]:
df.iloc[0, 1]

11

In [55]:
df.iloc[:2, 2]

a    12
b    16
Name: three, dtype: int32

In [57]:
df.iloc[0, -2:]

three    12
four     13
Name: a, dtype: int32

In [62]:
df.iloc[2:3, 1:3]

   two  three
c   19     20

In [63]:
df.iloc[-1]

one      18
two      19
three    20
four     21
Name: c, dtype: int32

In [65]:
df.iloc[-1] = df.iloc[-1]*2
df

   one  two  three  four
a   10   11     12    13
b   14   15     16    17
c   72   76     80    84

In [ ]:
# 모든 행과 열에 라벨을 가지고 있는 5행 5열 이상의 크기를 가지는 데이터 프레임을 생성하시오.
# 10가지 이상의 방법을 이용하여 특정 행 또는 열 또는 행과 열을 추출하는 작업을 수행하시오.

In [100]:
data = {'school': ['element', 'mid', 'high', 'college', 'university'],
        'level': [6, 2, 3, 2, 4],
        'cm': [150, 166, 173, 158, 183],
        'feet': [220, 240, 260, 250, 275],
        'gender': ['female', 'female', 'male', 'male', 'male'],
        'state': ['부산', '대구', '울산', '대전', '서울']}
ddf=pd.DataFrame(data)
ddf

       school  level   cm  feet  gender state
0     element      6  150   220  female    부산
1         mid      2  166   240  female    대구
2        high      3  173   260    male    울산
3     college      2  158   250    male    대전
4  university      4  183   275    male    서울

In [69]:
ddf['feet']

0    220
1    240
2    260
3    250
4    275
Name: feet, dtype: int64

In [80]:
ddf.cm > 160

0    False
1     True
2     True
3    False
4     True
Name: cm, dtype: bool

In [85]:
ddf.school == 'high'

0    False
1    False
2     True
3    False
4    False
Name: school, dtype: bool

In [86]:
ddf.loc[3]

school    college
level           2
cm            158
feet          250
gender       male
state          대전
Name: 3, dtype: object

In [87]:
ddf.iloc[2]

school    high
level        3
cm         173
feet       260
gender    male
state       울산
Name: 2, dtype: object

In [88]:
ddf.iloc[2,5]

'울산'

In [90]:
ddf[1:]

       school  level   cm  feet  gender state
1         mid      2  166   240  female    대구
2        high      3  173   260    male    울산
3     college      2  158   250    male    대전
4  university      4  183   275    male    서울

In [95]:
ddf.iloc[1:3,2:]

    cm  feet  gender state
1  166   240  female    대구
2  173   260    male    울산

In [97]:
ddf.iloc[1]

school       mid
level          2
cm           166
feet         240
gender    female
state         대구
Name: 1, dtype: object

In [98]:
ddf.level = ddf.level*2
ddf

       school  level   cm  feet  gender state
0     element     12  150   220  female    부산
1         mid      4  166   240  female    대구
2        high      6  173   260    male    울산
3     college      4  158   250    male    대전
4  university      8  183   275    male    서울

In [99]:
ddf

       school  level   cm  feet  gender state
0     element     12  150   220  female    부산
1         mid      4  166   240  female    대구
2        high      6  173   260    male    울산
3     college      4  158   250    male    대전
4  university      8  183   275    male    서울

## 데이터 조작

#### 데이터 갯수 세기 : count

In [101]:
s = pd.Series(range(10))
s[3] = np.nan
s

0    0.0
1    1.0
2    2.0
3    NaN
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
dtype: float64

In [102]:
s.count()

9

In [104]:
np.random.seed(2)
df = pd.DataFrame(np.random.randint(5, size=(4, 4)), dtype = float)
df.iloc[2, 3] = np.nan
df

     0    1    2    3
0  0.0  0.0  3.0  2.0
1  3.0  0.0  2.0  1.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0

In [105]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       4 non-null      float64
 1   1       4 non-null      float64
 2   2       4 non-null      float64
 3   3       3 non-null      float64
dtypes: float64(4)
memory usage: 256.0 bytes

In [107]:
df.count()

0    4
1    4
2    4
3    3
dtype: int64

In [108]:
import seaborn as sns
titanic = sns.load_dataset('titanic')

In [109]:
# 데이터 내용 미리보기 : head() or tail()
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [110]:
titanic.shape

(891, 15)

In [111]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [112]:
titanic.count()

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

In [113]:
# 돗수분포 value_counts - 시리즈 타입
titanic['embarked'].value_counts()

S    644
C    168
Q     77
Name: embarked, dtype: int64

In [114]:
# 객실 등급별 승객수를 추출하시오.
titanic['pclass'].value_counts()

3    491
1    216
2    184
Name: pclass, dtype: int64

#### 정렬
- sort_index()
- sort_values()

In [115]:
titanic['pclass'].value_counts().sort_index()

1    216
2    184
3    491
Name: pclass, dtype: int64

In [116]:
titanic['age'].sort_values()

803    0.42
755    0.67
644    0.75
469    0.75
78     0.83
       ...
859     NaN
863     NaN
868     NaN
878     NaN
888     NaN
Name: age, Length: 891, dtype: float64

In [117]:
titanic['age'].sort_values(ascending=False)

630    80.0
851    74.0
493    71.0
96     71.0
116    70.5
       ...
859     NaN
863     NaN
868     NaN
878     NaN
888     NaN
Name: age, Length: 891, dtype: float64

In [118]:
titanic.sort_values(by = 'age')

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
803,1,3,male,0.42,0,1,8.5167,C,Third,child,False,NaN,Cherbourg,yes,False
755,1,2,male,0.67,1,1,14.5000,S,Second,child,False,NaN,Southampton,yes,False
644,1,3,female,0.75,2,1,19.2583,C,Third,child,False,NaN,Cherbourg,yes,False
469,1,3,female,0.75,2,1,19.2583,C,Third,child,False,NaN,Cherbourg,yes,False
78,1,2,male,0.83,0,2,29.0000,S,Second,child,False,NaN,Southampton,yes,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
859,0,3,male,NaN,0,0,7.2292,C,Third,man,True,NaN,Cherbourg,no,True
863,0,3,female,NaN,8,2,69.5500,S,Third,woman,False,NaN,Southampton,no,False
868,0,3,male,NaN,0,0,9.5000,S,Third,man,True,NaN,Southampton,no,True
878,0,3,male,NaN,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False

In [119]:
titanic.sort_values(by = ['age','pclass'])

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
803,1,3,male,0.42,0,1,8.5167,C,Third,child,False,NaN,Cherbourg,yes,False
755,1,2,male,0.67,1,1,14.5000,S,Second,child,False,NaN,Southampton,yes,False
469,1,3,female,0.75,2,1,19.2583,C,Third,child,False,NaN,Cherbourg,yes,False
644,1,3,female,0.75,2,1,19.2583,C,Third,child,False,NaN,Cherbourg,yes,False
78,1,2,male,0.83,0,2,29.0000,S,Second,child,False,NaN,Southampton,yes,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
859,0,3,male,NaN,0,0,7.2292,C,Third,man,True,NaN,Cherbourg,no,True
863,0,3,female,NaN,8,2,69.5500,S,Third,woman,False,NaN,Southampton,no,False
868,0,3,male,NaN,0,0,9.5000,S,Third,man,True,NaN,Southampton,no,True
878,0,3,male,NaN,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False

In [120]:
np.random.seed(1)
s2 = pd.Series(np.random.randint(6, size=100))
s2.tail()

95    4
96    5
97    2
98    4
99    3
dtype: int32

In [121]:
s2.value_counts()

1    22
0    18
4    17
5    16
3    14
2    13
dtype: int64

In [122]:
df

     0    1    2    3
0  0.0  0.0  3.0  2.0
1  3.0  0.0  2.0  1.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0

In [123]:
df[0].value_counts()

3.0    2
0.0    1
4.0    1
Name: 0, dtype: int64

In [124]:
s2.value_counts().sort_index()

0    18
1    22
2    13
3    14
4    17
5    16
dtype: int64

In [125]:
s.sort_values()

0    0.0
1    1.0
2    2.0
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
3    NaN
dtype: float64

In [126]:
s.sort_values(ascending=False)

9    9.0
8    8.0
7    7.0
6    6.0
5    5.0
4    4.0
2    2.0
1    1.0
0    0.0
3    NaN
dtype: float64

In [127]:
df

     0    1    2    3
0  0.0  0.0  3.0  2.0
1  3.0  0.0  2.0  1.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0

In [128]:
df[2].sort_values()

1    2.0
0    3.0
2    4.0
3    4.0
Name: 2, dtype: float64

In [129]:
df.sort_values(by=2)

     0    1    2    3
1  3.0  0.0  2.0  1.0
0  0.0  0.0  3.0  2.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0

In [131]:
df.sort_values(by=[1, 2], ascending=False)

     0    1    2    3
3  4.0  3.0  4.0  2.0
2  3.0  2.0  4.0  NaN
0  0.0  0.0  3.0  2.0
1  3.0  0.0  2.0  1.0

In [ ]:
# titanic 데이터셋을 이용하여 승객의 성별 인원수, 나이별 인원수, 객실별인원수 , 사망/생존 인원수 추출
# sort_values() 메서드를 이용할 것

In [132]:
titanic.sort_values(by=['sex','age','pclass','survived','alive','alone'])

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
469,1,3,female,0.75,2,1,19.2583,C,Third,child,False,NaN,Cherbourg,yes,False
644,1,3,female,0.75,2,1,19.2583,C,Third,child,False,NaN,Cherbourg,yes,False
172,1,3,female,1.00,1,1,11.1333,S,Third,child,False,NaN,Southampton,yes,False
381,1,3,female,1.00,0,2,15.7417,C,Third,child,False,NaN,Cherbourg,yes,False
297,0,1,female,2.00,1,2,151.5500,S,First,child,False,C,Southampton,no,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
107,1,3,male,NaN,0,0,7.7750,S,Third,man,True,NaN,Southampton,yes,True
444,1,3,male,NaN,0,0,8.1125,S,Third,man,True,NaN,Southampton,yes,True
643,1,3,male,NaN,0,0,56.4958,S,Third,man,True,NaN,Southampton,yes,True
692,1,3,male,NaN,0,0,56.4958,S,Third,man,True,NaN,Southampton,yes,True
828,1,3,male,NaN,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,yes,True

In [137]:
titanic['sex'].sort_values()

383    female
218    female
609    female
216    female
215    female
        ...
371      male
372      male
373      male
360      male
890      male
Name: sex, Length: 891, dtype: object

In [138]:
titanic['age'].sort_values()

803    0.42
755    0.67
644    0.75
469    0.75
78     0.83
       ...
859     NaN
863     NaN
868     NaN
878     NaN
888     NaN
Name: age, Length: 891, dtype: float64

In [139]:
titanic['pclass'].sort_values()

445    1
310    1
309    1
307    1
306    1
      ..
379    3
381    3
382    3
371    3
890    3
Name: pclass, Length: 891, dtype: int64

In [140]:
titanic['survived'].sort_values()

0      0
519    0
521    0
522    0
524    0
      ..
546    1
215    1
216    1
218    1
445    1
Name: survived, Length: 891, dtype: int64

In [141]:
titanic['alive'].sort_values()

0       no
519     no
521     no
522     no
524     no
      ...
546    yes
215    yes
216    yes
218    yes
445    yes
Name: alive, Length: 891, dtype: object

In [142]:
titanic['alone'].sort_values()

0      False
469    False
457    False
453    False
451    False
       ...
481     True
482     True
483     True
465     True
890     True
Name: alone, Length: 891, dtype: bool

## 행/열 합계
- sum(axis), axis = 0 행, axis=1 열

In [143]:
df2 = pd.DataFrame(np.random.randint(10, size = (4, 8)))
df2

   0  1  2  3  4  5  6  7
0  5  7  8  4  4  7  7  4
1  9  0  2  0  7  1  7  9
2  8  4  0  1  9  8  2  3
3  1  2  7  2  6  0  9  2

In [144]:
# 행방향의 합계
df2.sum(axis = 1)

0    46
1    35
2    35
3    29
dtype: int64

In [145]:
df2['rowSum'] = df2.sum(axis = 1)
df2

   0  1  2  3  4  5  6  7  rowSum
0  5  7  8  4  4  7  7  4      46
1  9  0  2  0  7  1  7  9      35
2  8  4  0  1  9  8  2  3      35
3  1  2  7  2  6  0  9  2      29

In [146]:
df2.sum() # axis = 0

0          23
1          13
2          17
3           7
4          26
5          16
6          25
7          18
rowSum    145
dtype: int64

In [147]:
df2.loc['Total', :] =df2.sum()
df2

          0     1     2    3     4     5     6     7  rowSum
0       5.0   7.0   8.0  4.0   4.0   7.0   7.0   4.0    46.0
1       9.0   0.0   2.0  0.0   7.0   1.0   7.0   9.0    35.0
2       8.0   4.0   0.0  1.0   9.0   8.0   2.0   3.0    35.0
3       1.0   2.0   7.0  2.0   6.0   0.0   9.0   2.0    29.0
Total  23.0  13.0  17.0  7.0  26.0  16.0  25.0  18.0   145.0

In [ ]:
# 연습문제
# 타이타닉 호의 승객들의 평균나이를 추출하시오
# 타이타닉 호의 승객 중 여성승객의 평균나이 추출
# 타이타닉 1등실, 여성 승객의 평균나이 추출

In [148]:
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [160]:
titanic.mean()

C:\Users\admin\AppData\Local\Temp/ipykernel_10980/929819788.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  titanic.mean()

survived       0.383838
pclass         2.308642
age           29.699118
sibsp          0.523008
parch          0.381594
fare          32.204208
adult_male     0.602694
alone          0.602694
dtype: float64

In [161]:
titanic['age'].mean()

29.69911764705882

In [170]:
titanic.loc[titanic.sex=='female', 'age'].mean()

27.915708812260537

In [179]:
titanic.loc[(titanic.pclass==1) & (titanic.sex =='female'), 'age'].mean()

34.61176470588235

### apply 함수
- 행이나 열에 반복적으로 처리하는 함수를 적용하는 함수
- 람다(lambda)함수 : 익명의 함수
- 형식 => lambda 입력 : 출력

In [181]:
# 두 수를 입력받아 합을 계산하는 함수
def hap(x, y):
    return x + y

In [182]:
hap(10, 20)

30

In [186]:
# 람다 형식으로 표현하려면
(lambda x, y : x + y)(10, 20)

30

In [184]:
x=2
x

2

In [185]:
x=2
y=3
x + y

5

### map(함수, 리스트)

In [188]:
list(map((lambda x : x ** 2), range(5)))

[0, 1, 4, 9, 16]

In [189]:
df3 = pd.DataFrame({
    'A':[1, 3, 4, 3, 4],
    'B':[2, 3, 1, 2, 3],
    'c':[1, 5, 2, 4, 4]
})
df3

   A  B  c
0  1  2  1
1  3  3  5
2  4  1  2
3  3  2  4
4  4  3  4

In [191]:
# 각 열에 최대값과 최소값의 차이를 구하시오
df3.apply(lambda x: x.max() - x.min()) # axis = 0

A    3
B    2
c    4
dtype: int64

In [193]:
# 각 행의 최대값과 최소값의 차이
df3.apply(lambda x: x.max() - x.min(), axis=1 )

0    1
1    2
2    3
3    2
4    1
dtype: int64

In [201]:
# 각 열의 값들의 건수를 추출하시오
df3.apply(pd.value_counts)

     A    B    c
1  1.0  1.0  1.0
2  NaN  2.0  1.0
3  2.0  2.0  NaN
4  2.0  NaN  2.0
5  NaN  NaN  1.0

In [207]:
# 타이타닉 호의 승객 중 나이가 20살을 기준으로 성인(Adult)과 미성년자(Child)를 구별하여 파생변수
# Adult/Child에 담는 작업을 수행하시오.
titanic.apply(lamba x == 'Adult': pd.age > 20)

SyntaxError: invalid syntax (Temp/ipykernel_10980/3226028867.py, line 3)

In [217]:
titanic['adult/child'] = titanic.apply(lambda df : 'Adult' if df.age >= 20 else 'Child', axis = 1)
titanic.head()
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,adult/child
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,Adult
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,Child
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,Child
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,Adult
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,Adult

### fillna()
- NaN 값을 원하는 값으로 대체하는 함수

In [218]:
df3

   A  B  c
0  1  2  1
1  3  3  5
2  4  1  2
3  3  2  4
4  4  3  4

In [219]:
df3.apply(pd.value_counts)

     A    B    c
1  1.0  1.0  1.0
2  NaN  2.0  1.0
3  2.0  2.0  NaN
4  2.0  NaN  2.0
5  NaN  NaN  1.0

In [220]:
df3.apply(pd.value_counts).fillna(0.0)

     A    B    c
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

In [222]:
# 타이타닉호의 승객의 나이 중 NaN으로 나이가 명시되지 않은 고객의 나이를 평균 나이값으로 대체하는 작업을 수행하시오.
titanic['age'].mean()

29.69911764705882

In [230]:
titanic.age.fillna(29.69911764705882)

0      22.000000
1      38.000000
2      26.000000
3      35.000000
4      35.000000
         ...
886    27.000000
887    19.000000
888    29.699118
889    26.000000
890    32.000000
Name: age, Length: 891, dtype: float64

### astype(): 자료형을 바꾸는 함수

In [233]:
df3.apply(pd.value_counts).fillna(0).astype(int)

   A  B  c
1  1  1  1
2  0  2  1
3  2  2  0
4  2  0  2
5  0  0  1

### 데이터프레임의 인덱스 설정 및 제거
- set_index : 기존의 행 인덱스를 제거하고 데이터 열 중 하나를 인덱스로 설정
- reset_index : 기존의 행 인덱서를 제거하고 인덱스를 데이터 열로 추가

In [ ]:
df1 = pd.DataFrame(np.round(np.random.rand(3, 5),2),
                   columns = ['c1', 'c2', 'c3'],

In [234]:
df1 = pd.DataFrame(np.vstack([list('ABCDE'), np.round(np.random.rand(3, 5) ,2)]).T,
                   columns=['C1','C2','C3','C4'])
df1

  C1    C2    C3    C4
0  A  0.38  0.15  0.76
1  B  0.76  0.58  0.47
2  C  0.77  0.01  0.27
3  D   0.3  0.71  0.83
4  E  0.77  0.47  0.55

In [239]:
df2 = df1.set_index('C1')

In [240]:
df2.set_index('C2')

        C3    C4
C2
0.38  0.15  0.76
0.76  0.58  0.47
0.77  0.01  0.27
0.3   0.71  0.83
0.77  0.47  0.55

In [242]:
df2.reset_index(drop=True)

     C2    C3    C4
0  0.38  0.15  0.76
1  0.76  0.58  0.47
2  0.77  0.01  0.27
3   0.3  0.71  0.83
4  0.77  0.47  0.55

### 다중 인덱스

In [282]:
df3 = pd.DataFrame(np.round(np.random.randn(5, 4), 2),
                  columns = [['A','A','B','B'],
                             ['C1','C2','C1','C2']])
df3

      A           B
     C1    C2    C1    C2
0  0.18 -1.06 -0.29 -1.20
1 -1.14  0.93  0.09  1.51
2  1.13  0.13 -0.07 -0.58
3  0.50  1.14  0.74  0.99
4  0.69 -0.41  0.21 -0.57

In [283]:
df3.columns.names=['Cidx1','Cidx2']
df3

Cidx1     A           B
Cidx2    C1    C2    C1    C2
0      0.18 -1.06 -0.29 -1.20
1     -1.14  0.93  0.09  1.51
2      1.13  0.13 -0.07 -0.58
3      0.50  1.14  0.74  0.99
4      0.69 -0.41  0.21 -0.57

In [284]:
df3.index

RangeIndex(start=0, stop=5, step=1)

In [250]:
df4 = pd.DataFrame(np.round(np.random.randn(6,4), 2),
                  columns = [['A','A','B','B'],['C','D','C','D']],
                  index =[['M','M','M','F','F','F'],
                          ['id_' + str(i + 1)for i in range(3)]*2])
df4

           A           B
           C     D     C     D
M id_1  1.17  0.26 -1.51  1.06
  id_2  0.18  1.76 -0.73  0.51
  id_3 -0.70  1.78  0.91  0.82
F id_1  0.71 -0.17 -0.20  0.42
  id_2  1.36 -0.21  1.32 -1.59
  id_3 -0.10 -0.31  0.23 -0.50

In [251]:
['id_' + str(i + 1)for i in range(3)]*2

['id_1', 'id_2', 'id_3', 'id_1', 'id_2', 'id_3']

In [252]:
np.round(np.random.randn(6,4), 2)

array([[-0.02, -0.3 , -0.1 ,  0.26],
       [-0.97, -0.07,  1.02,  0.01],
       [-1.78,  0.28,  0.77, -0.28],
       [-0.07,  0.48,  0.93, -1.85],
       [ 0.27, -0.11, -0.71, -0.79],
       [-0.38,  0.53,  0.19,  1.33]])

In [253]:
df4.columns.names = ['Cidx1','Cidx2']
df4.index.names = ['Ridx1','Ridx2']
df4

Cidx1           A           B
Cidx2           C     D     C     D
Ridx1 Ridx2
M     id_1   1.17  0.26 -1.51  1.06
      id_2   0.18  1.76 -0.73  0.51
      id_3  -0.70  1.78  0.91  0.82
F     id_1   0.71 -0.17 -0.20  0.42
      id_2   1.36 -0.21  1.32 -1.59
      id_3  -0.10 -0.31  0.23 -0.50

In [254]:
# 행인덱스와 열인덱스 교환
## stack() : 열인덱스 => 행인덱스
## unstack() : 행인덱스 => 열인덱스
df4.stack('Cidx1')

Cidx2                 C     D
Ridx1 Ridx2 Cidx1
M     id_1  A      1.17  0.26
            B     -1.51  1.06
      id_2  A      0.18  1.76
            B     -0.73  0.51
      id_3  A     -0.70  1.78
            B      0.91  0.82
F     id_1  A      0.71 -0.17
            B     -0.20  0.42
      id_2  A      1.36 -0.21
            B      1.32 -1.59
      id_3  A     -0.10 -0.31
            B      0.23 -0.50

In [257]:
df4.stack(1)

Cidx1                 A     B
Ridx1 Ridx2 Cidx2
M     id_1  C      1.17 -1.51
            D      0.26  1.06
      id_2  C      0.18 -0.73
            D      1.76  0.51
      id_3  C     -0.70  0.91
            D      1.78  0.82
F     id_1  C      0.71 -0.20
            D     -0.17  0.42
      id_2  C      1.36  1.32
            D     -0.21 -1.59
      id_3  C     -0.10  0.23
            D     -0.31 -0.50

In [285]:
df3

Cidx1     A           B
Cidx2    C1    C2    C1    C2
0      0.18 -1.06 -0.29 -1.20
1     -1.14  0.93  0.09  1.51
2      1.13  0.13 -0.07 -0.58
3      0.50  1.14  0.74  0.99
4      0.69 -0.41  0.21 -0.57

In [289]:
# 다중 인덱스를 가지고 있는 경우에 인덱스 값이 하나의 라벨이나 숫자가 아니라 튜플로 둘러싸여야 한다.
df3.loc[0, ('B','C1')]=100
df3

Cidx1     A             B           C1
Cidx2    C1    C2      C1    C2
0      0.18 -1.06  100.00 -1.20    NaN
1     -1.14  0.93    0.09  1.51    NaN
2      1.13  0.13   -0.07 -0.58    NaN
3      0.50  1.14    0.74  0.99    NaN
4      0.69 -0.41    0.21 -0.57    NaN
B       NaN   NaN     NaN   NaN  100.0

In [290]:
df3.loc[0, ('B','C1')]

100.0

In [291]:
# iloc 인덱서를 사용할 경우에는 튜플 형태의 다중인덱스를 사용할 수 없다.
df3.iloc[0, 2]

100.0

In [292]:
df3['A']

Cidx2    C1    C2
0      0.18 -1.06
1     -1.14  0.93
2      1.13  0.13
3      0.50  1.14
4      0.69 -0.41
B       NaN   NaN

In [293]:
df4

Cidx1           A           B
Cidx2           C     D     C     D
Ridx1 Ridx2
M     id_1   1.17  0.26 -1.51  1.06
      id_2   0.18  1.76 -0.73  0.51
      id_3  -0.70  1.78  0.91  0.82
F     id_1   0.71 -0.17 -0.20  0.42
      id_2   1.36 -0.21  1.32 -1.59
      id_3  -0.10 -0.31  0.23 -0.50

In [294]:
df4.loc[('M','id_1'), ('A', 'C')]

1.17

### 데이터 프레임 합성 : merge, concatenate

In [304]:
df1 = pd.DataFrame({
    '고객번호':[1001, 1002, 1003, 1004, 1005, 1006, 1007],
    '고객이름':['고둘리','도우너','그냥또치','고길동','고희동','마이콜','고영희']},
    columns = ['고객번호','고객이름'])
df1

   고객번호  고객이름
0  1001   고둘리
1  1002   도우너
2  1003  그냥또치
3  1004   고길동
4  1005   고희동
5  1006   마이콜
6  1007   고영희

In [305]:
df2 = pd.DataFrame({
    '고객번호':[1001, 1001, 1005, 1006, 1007, 1001],
    '예금금액':[10000, 20000, 15000, 5000, 100000, 30000]},
    columns = ['고객번호','예금금액'])
df2

   고객번호    예금금액
0  1001   10000
1  1001   20000
2  1005   15000
3  1006    5000
4  1007  100000
5  1001   30000

In [306]:
# inner Join
pd.merge(df1, df2)

   고객번호 고객이름    예금금액
0  1001  고둘리   10000
1  1001  고둘리   20000
2  1001  고둘리   30000
3  1005  고희동   15000
4  1006  마이콜    5000
5  1007  고영희  100000

In [307]:
# outer Join
pd.merge(df1, df2, how = 'outer')

   고객번호  고객이름      예금금액
0  1001   고둘리   10000.0
1  1001   고둘리   20000.0
2  1001   고둘리   30000.0
3  1002   도우너       NaN
4  1003  그냥또치       NaN
5  1004   고길동       NaN
6  1005   고희동   15000.0
7  1006   마이콜    5000.0
8  1007   고영희  100000.0

In [308]:
# outer Join
pd.merge(df1, df2, how = 'left')

   고객번호  고객이름      예금금액
0  1001   고둘리   10000.0
1  1001   고둘리   20000.0
2  1001   고둘리   30000.0
3  1002   도우너       NaN
4  1003  그냥또치       NaN
5  1004   고길동       NaN
6  1005   고희동   15000.0
7  1006   마이콜    5000.0
8  1007   고영희  100000.0

In [309]:
pd.merge(df1, df2, how = 'right')

   고객번호 고객이름    예금금액
0  1001  고둘리   10000
1  1001  고둘리   20000
2  1005  고희동   15000
3  1006  마이콜    5000
4  1007  고영희  100000
5  1001  고둘리   30000

In [312]:
# join 메서드: 행인덱스를 기준으로 결합한다.
df2.set_index('고객번호', inplace=True)

In [314]:
df2

        예금금액
고객번호
1001   10000
1001   20000
1005   15000
1006    5000
1007  100000
1001   30000

In [313]:
# join 메서드: 행인덱스를 기준으로 결합한다.
df1.join(df2, how='outer')

        고객번호  고객이름      예금금액
0     1001.0   고둘리       NaN
1     1002.0   도우너       NaN
2     1003.0  그냥또치       NaN
3     1004.0   고길동       NaN
4     1005.0   고희동       NaN
5     1006.0   마이콜       NaN
6     1007.0   고영희       NaN
1001     NaN   NaN   10000.0
1001     NaN   NaN   20000.0
1001     NaN   NaN   30000.0
1005     NaN   NaN   15000.0
1006     NaN   NaN    5000.0
1007     NaN   NaN  100000.0

### concat 함수
- 기준열을 사용하지 않고 단순히 데이터를 연결하는 방식

In [315]:
s1 = pd.Series([0, 1], index = ['A', 'B'])
s2 = pd.Series([2, 3, 4], index = ['A', 'B', 'C'])

In [316]:
s1

A    0
B    1
dtype: int64

In [317]:
s2

A    2
B    3
C    4
dtype: int64

In [318]:
pd.concat([s1, s2])

A    0
B    1
A    2
B    3
C    4
dtype: int64

In [319]:
df1 = pd.DataFrame(np.arange(6).reshape(3, 2),
                  index = list('abc'),
                  columns = ['데이터1', '데이터2'])
df1

   데이터1  데이터2
a     0     1
b     2     3
c     4     5

In [320]:
df2 = pd.DataFrame(5 + np.arange(4).reshape(2, 2),
                  index = list('ac'),
                  columns = ['데이터3', '데이터4'])
df2

   데이터3  데이터4
a     5     6
c     7     8

In [321]:
pd.concat([df1, df2], axis = 1)

   데이터1  데이터2  데이터3  데이터4
a     0     1   5.0   6.0
b     2     3   NaN   NaN
c     4     5   7.0   8.0

In [326]:
data = {
    "도시": ["서울", "서울", "서울", "부산", "부산", "부산", "인천", "인천"],
    "연도": ["2015", "2010", "2005", "2015", "2010", "2005", "2015", "2010"],
    "인구": [9904312, 9631482, 9762546, 3448737, 3393191, 3512547, 2890451, 263203],
    "지역": ["수도권", "수도권", "수도권", "경상권", "경상권", "경상권", "수도권", "수도권"]
}
columns = ['도시', '연도', '인구', '지역']
df1 = pd.DataFrame(data, columns=columns)
df1

   도시    연도       인구   지역
0  서울  2015  9904312  수도권
1  서울  2010  9631482  수도권
2  서울  2005  9762546  수도권
3  부산  2015  3448737  경상권
4  부산  2010  3393191  경상권
5  부산  2005  3512547  경상권
6  인천  2015  2890451  수도권
7  인천  2010   263203  수도권

In [328]:
# pivot(행인덱스로 사용할 열이름, 열인덱스로 사용할 열이름, 데이터로 사용할 열이름)
df1.pivot('도시', '연도', '인구')

연도       2005       2010       2015
도시
부산  3512547.0  3393191.0  3448737.0
서울  9762546.0  9631482.0  9904312.0
인천        NaN   263203.0  2890451.0

### 그룹분석 : groupby() 
- size, count : 그룹 데이터의 갯수
- mean, median, min, max
- sum, prod, std, var, quantile
- first, last
- agg, aggreate
- describe 
- apply
- transform

In [329]:
df2 = pd.DataFrame({
    'key1' : list('AABBA'),
    'key2' : ['one', 'two', 'one', 'two', 'one'],
    'data1' : [1, 2, 3, 4, 5],
    'data2' : [10, 20, 30, 40, 50]
})
df2

  key1 key2  data1  data2
0    A  one      1     10
1    A  two      2     20
2    B  one      3     30
3    B  two      4     40
4    A  one      5     50

In [330]:
# 그룹설정
groups = df2.groupby(df2.key1)
groups

In [331]:
groups.groups # 그룹화 한 것들의 인덱스가 저장되어 있다.

{'A': [0, 1, 4], 'B': [2, 3]}

In [332]:
# A 그룹과 B 그룹의 데이터들의 합계를 구하시오.
groups.sum()

      data1  data2
key1
A         8     80
B         7     70

In [334]:
df2.data1.groupby(df2.key1).sum()

key1
A    8
B    7
Name: data1, dtype: int64

In [335]:
df2.data1

0    1
1    2
2    3
3    4
4    5
Name: data1, dtype: int64

In [336]:
df2.groupby(df2.key1)['data1'].sum()

key1
A    8
B    7
Name: data1, dtype: int64

In [337]:
df2.groupby(df2.key1).sum()

      data1  data2
key1
A         8     80
B         7     70

In [342]:
df2.groupby([df2.key1, df2.key2]).sum()['data1']

key1  key2
A     one     6
      two     2
B     one     3
      two     4
Name: data1, dtype: int64

In [343]:
df2.data1.groupby([df2.key1, df2.key2]).sum()

key1  key2
A     one     6
      two     2
B     one     3
      two     4
Name: data1, dtype: int64